{
    "filename": "pdf.pdf",
    "metadata": {
        "title": "DYNAMICALLY UNFOLDING RECURRENT RESTORER: A MOVING ENDPOINT CONTROL METHOD FOR IMAGE RESTORATION",
        "author": "Xiaoshuai Zhang, Institute of Computer Science and Technology, Peking University jet@pku.edu.cn",
        "date": 2019,
        "identifiers": {
            "url": "https://openreview.net/pdf?id=SJfZKiC5FX"
        },
        "abstract": "In this paper, we propose a new control framework called the moving endpoint control to restore images corrupted by different degradation levels using a single model. The proposed control problem contains an image restoration dynamic which is modeled by a convolutional RNN. The moving endpoint, which is essentially the terminal time of the associated dynamic, is determined by a policy network. We call the proposed model the dynamically unfolding recurrent restorer (DURR). Numerical experiments show that DURR is able to achieve state-of-the-art performances on blind image denoising and JPEG image deblocking. Furthermore, DURR can well generalize to images with higher degradation levels that are not included in the training stage.1"
    },
    "keywords": [
        {
            "term": "recurrent neural network",
            "url": "https://en.wikipedia.org/wiki/recurrent_neural_network"
        },
        {
            "term": "image restoration",
            "url": "https://en.wikipedia.org/wiki/image_restoration"
        },
        {
            "term": "convolutional neural network",
            "url": "https://en.wikipedia.org/wiki/convolutional_neural_network"
        },
        {
            "term": "JPEG",
            "url": "https://en.wikipedia.org/wiki/JPEG"
        },
        {
            "term": "image denoising",
            "url": "https://en.wikipedia.org/wiki/image_denoising"
        },
        {
            "term": "quality factor",
            "url": "https://en.wikipedia.org/wiki/quality_factor"
        }
    ],
    "abbreviations": {
        "DURR": "dynamically unfolding recurrent restorer",
        "CNN": "convolutional neural network",
        "RNN": "recurrent neural network",
        "QF": "quality factor"
    },
    "highlights": [
        "Image restoration, including image denoising, deblurring, inpainting, etc., is one of the most important areas in imaging science",
        "This criterion can be used directly as our policy unit, but the independency of signal and noise may not hold for some restoration tasks such as real image denoising, which has higher noise level in the low-light regions, and JPEG image deblocking, in which artifacts are highly related to the original image",
        "We proposed a novel image restoration model based on the moving endpoint control in order to handle varied noise levels using a single model",
        "The restoration unit used an recurrent neural network to realize the dynamics in the control problem",
        "A policy unit was proposed for the policy unit to determine the loop times of the restoration unit for optimal results",
        "Our model achieved the state-of-the-art results in blind image denoising and JPEG deblocking"
    ],
    "key_statements": [
        "Image restoration, including image denoising, deblurring, inpainting, etc., is one of the most important areas in imaging science",
        "Before the uprise of deep learning methods, there were two classes of image restoration approaches that were widely adopted in the field: transformation based approach and PDE approach",
        "We propose a single image restoration model that can robustly restore images with varied degradation levels even when the degradation level is well outside of that of the training set",
        "These results indicate that the restoration unit has the potential to generalize on unseen degradation levels when trained with good policies",
        "We discuss two approaches that can be used as policy unit: Handcraft policy: Previous work (Mrázek & Navara, 2003) has proposed a handcraft policy that selects a terminal time which optimizes the correlation of the signal and noise in the filtered image",
        "This criterion can be used directly as our policy unit, but the independency of signal and noise may not hold for some restoration tasks such as real image denoising, which has higher noise level in the low-light regions, and JPEG image deblocking, in which artifacts are highly related to the original image",
        "It is worth noting that the noise level of the input image in Fig. 6 is 65, which is unseen by both DnCNN and dynamically unfolding recurrent restorer during training",
        "We proposed a novel image restoration model based on the moving endpoint control in order to handle varied noise levels using a single model",
        "The restoration unit used an recurrent neural network to realize the dynamics in the control problem",
        "A policy unit was proposed for the policy unit to determine the loop times of the restoration unit for optimal results",
        "Our model achieved the state-of-the-art results in blind image denoising and JPEG deblocking"
    ],
    "summary": [
        "Image restoration, including image denoising, deblurring, inpainting, etc., is one of the most important areas in imaging science.",
        "Our proposed model for image restoration is inspired by the recent development on the relation between deep learning and optimal control.",
        "In the context of image restoration, the control dynamic X = f (X(t), ω(t)), t ∈ (0, τ ) can be, for example, a diffusion process learned using a deep neural network.",
        "For varied degradation levels and different images, the optimal terminal time τ of the dynamics may vary.",
        "We are the first to use convolutional RNN for image restoration with unknown degradation levels, where the unfolding time of the RNN is determined dynamically at run-time by a policy unit.",
        "The proposed architecture, i.e. DURR, contains an RNN imitating a nonlinear diffusion for image restoration, and a deep policy network to determine the terminal time of the RNN.",
        "The restoration unit trained on multiple noise levels with naive policy has the worst performance.",
        "These results indicate that the restoration unit has the potential to generalize on unseen degradation levels when trained with good policies.",
        "For image denoising, the noise level and the associated loop times are set to (25, 4), (35, 6), (45, 9), and (55, 12).",
        "We discuss two approaches that can be used as policy unit: Handcraft policy: Previous work (Mrázek & Navara, 2003) has proposed a handcraft policy that selects a terminal time which optimizes the correlation of the signal and noise in the filtered image.",
        "This criterion can be used directly as our policy unit, but the independency of signal and noise may not hold for some restoration tasks such as real image denoising, which has higher noise level in the low-light regions, and JPEG image deblocking, in which artifacts are highly related to the original image.",
        "The terminal time {Ni} is determined by a policy network P (x, θ), where x is the output of the restoration unit at each iteration and θ the set of weights.",
        "Despite the fact that the parameters of our model (1.8 × 105 for the restoration unit and 1.0 × 105 for the policy unit) is less than the DnCNN, one can see that DURR outperforms DnCNN on most of the noise-levels.",
        "It is worth noting that the noise level of the input image in Fig. 6 is 65, which is unseen by both DnCNN and DURR during training.",
        "We proposed a novel image restoration model based on the moving endpoint control in order to handle varied noise levels using a single model.",
        "Thanks to the flexibility of the given policy, DURR has shown strong abilities of generalization in our experiments"
    ],
    "headline": "We propose a new control framework called the moving endpoint control to restore images corrupted by different degradation levels using a single model",
    "reference_links": [
        {
            "id": "Aharon_et+al_2006_a",
            "entry": "Michal Aharon, Michael Elad, and Alfred Bruckstein. k-svd: An algorithm for designing overcomplete dictionaries for sparse representation. IEEE Transactions on signal processing, 54(11):4311–4322, 2006.",
            "scholar_url": "https://scholar.google.co.uk/scholar?q=Aharon%2C%20Michal%20Elad%2C%20Michael%20Bruckstein%2C%20Alfred%20k-svd%3A%20An%20algorithm%20for%20designing%20overcomplete%20dictionaries%20for%20sparse%20representation%202006",
            "oa_query": "https://api.scholarcy.com/oa_version?query=Aharon%2C%20Michal%20Elad%2C%20Michael%20Bruckstein%2C%20Alfred%20k-svd%3A%20An%20algorithm%20for%20designing%20overcomplete%20dictionaries%20for%20sparse%20representation%202006"
        }
    ]
}
