{
    "filename": "pdf.pdf",
    "metadata": {
        "title": "OPTIMAL CONTROL VIA NEURAL NETWORKS: A CONVEX APPROACH",
        "author": "Yize Chen, Yuanyuan Shi, Baosen Zhang Department of Electrical and Computer Engineering, University of Washington, Seattle, WA 98195, USA {yizechen, yyshi, zhangbao}@uw.edu",
        "date": 2019,
        "identifiers": {
            "url": "https://openreview.net/pdf?id=H1MW72AcK7"
        },
        "abstract": "Control of complex systems involves both system identification and controller design. Deep neural networks have proven to be successful in many identification tasks, however, from model-based control perspective, these networks are difficult to work with because they are typically nonlinear and nonconvex. Therefore many systems are still identified and controlled based on simple linear models despite their poor representation capability. In this paper we bridge the gap between model accuracy and control tractability faced by neural networks, by explicitly constructing networks that are convex with respect to their inputs. We show that these input convex networks can be trained to obtain accurate models of complex physical systems. In particular, we design input convex recurrent neural networks to capture temporal behavior of dynamical systems. Then optimal controllers can be achieved via solving a convex model predictive control problem. Experiment results demonstrate the good potential of the proposed input convex neural network based approach in a variety of control applications. In particular we show that in the MuJoCo locomotion tasks, we could achieve over 10% higher performance using 5× less time compared with state-of-the-art model-based reinforcement learning method; and in the building HVAC control example, our method achieved up to 20% energy reduction compared with classic linear models."
    },
    "keywords": [
        {
            "term": "dynamics",
            "url": "https://en.wikipedia.org/wiki/dynamics"
        },
        {
            "term": "deep reinforcement learning",
            "url": "https://en.wikipedia.org/wiki/deep_reinforcement_learning"
        },
        {
            "term": "reinforcement learning",
            "url": "https://en.wikipedia.org/wiki/reinforcement_learning"
        },
        {
            "term": "multi-layer perceptrons",
            "url": "https://en.wikipedia.org/wiki/multi-layer_perceptrons"
        },
        {
            "term": "optimal control",
            "url": "https://en.wikipedia.org/wiki/optimal_control"
        },
        {
            "term": "neural network",
            "url": "https://en.wikipedia.org/wiki/neural_network"
        },
        {
            "term": "linear model",
            "url": "https://en.wikipedia.org/wiki/linear_model"
        },
        {
            "term": "physics",
            "url": "https://en.wikipedia.org/wiki/physics"
        },
        {
            "term": "Department of Energy",
            "url": "https://en.wikipedia.org/wiki/Department_of_Energy"
        },
        {
            "term": "Deep neural networks",
            "url": "https://en.wikipedia.org/wiki/Deep_neural_networks"
        },
        {
            "term": "HVAC",
            "url": "https://en.wikipedia.org/wiki/HVAC"
        },
        {
            "term": "root mean square error",
            "url": "https://en.wikipedia.org/wiki/root_mean_square_error"
        },
        {
            "term": "model predictive control",
            "url": "https://en.wikipedia.org/wiki/model_predictive_control"
        }
    ],
    "abbreviations": {
        "ICNN": "input convex neural network",
        "MPC": "model predictive control",
        "DNNs": "Deep neural networks",
        "ICRNN": "input convex recurrent neural networks",
        "MLP": "multi-layer perceptrons",
        "DoE": "Department of Energy",
        "RMSE": "root mean square error"
    },
    "highlights": [
        "Decisions on how to best operate and control complex physical systems such as the power grid, commercial and industrial buildings, transportation networks and robotic systems are of critical societal importance",
        "The proposed method can be used as a flexible building block in decision making problems, where we use input convex neural network to represent system dynamics for MuJoco simulators, and we use input convex recurrent neural networks in an end-to-end fashion to find the optimal control inputs",
        "The overall test root mean square error (RMSE) is 0.054 for input convex recurrent neural networks and 0.051 for conventional RNN, both of which are much smaller than the error made by RC model (0.240)",
        "As shown in Fig. 4(b), with the same constraints on building temperature interval of [19◦C, 24◦C], the building energy consumption is reduced by 23.25% after implementing the new temperature set points calculated by input convex recurrent neural networks",
        "In this work we proposed a novel optimal control framework that uses deep neural networks engineered to be convex from the input to the output",
        "We show that many interesting data-driven control problems can be cast as convex optimization problems using the proposed network architecture"
    ],
    "key_statements": [
        "Decisions on how to best operate and control complex physical systems such as the power grid, commercial and industrial buildings, transportation networks and robotic systems are of critical societal importance",
        "Our proposed method) firstly utilizes an input convex network model to learn the system dynamics and computes the best control decisions via solving a convex model predictive control (MPC) problem, which is tractable and has optimality guarantees. This is different from existing methods that uses model-free end-to-end controller which directly maps input to output). Another major contribution of our work is that we explicitly prove that input convex neural network can represent all convex functions and systems dynamics, and is exponentially more efficient than widely used convex piecewise linear approximations (<a class=\"ref-link\" id=\"cMagnani_2009_a\" href=\"#rMagnani_2009_a\">Magnani & Boyd, 2009</a>)",
        "Our work shows how the proposed input convex neural network control algorithm achieves the benefits from both sides of the world",
        "To model the temporal dependency of the system dynamics, we propose to use recurrent neural networks",
        "We first construct a neural network with ReLU activation functions and both positive and negative weights, we show that the weights between different layers of the network can be restricted to be nonnegative by a simple duplication trick",
        "A key reason that we propose to use input convex neural network to fit a function rather than directly finding a maximum of affine functions is that the former is a much more efficient parameterization than the latter",
        "The proposed method can be used as a flexible building block in decision making problems, where we use input convex neural network to represent system dynamics for MuJoco simulators, and we use input convex recurrent neural networks in an end-to-end fashion to find the optimal control inputs",
        "Both examples demonstrate that proposed method: 1) discovers the connection between controllable variables and the system dynamics or cost objectives; 2) is lightweight and sample-efficient; 3) achieves generalizable and more stable control performances compared with previous model-based reinforcement learning and simplified linear control approaches.\n4.1",
        "We train and represent the locomotion state transition dynamics st+1 =g2 using a 2-layer input convex neural network with ReLU activations, which could be integrated into the following finite-horizon control problem to find the optimal action sequence ut , ...,ut+T for fixed looking ahead horizon T : t+T",
        "Continuous Control Performance During training, we found both input convex neural network and multi-layer perceptrons are able to predict robotic states quite accurately based on (6b)",
        "We firstly learn an input convex recurrent neural networks model f (·) of the building dynamics, which is trained to minimize the error between Pt and f, while nw denotes the memory window of recurrent neural networks",
        "Results In terms of the fitting performance, input convex recurrent neural networks provides a competitive result compared to conventional RNN model",
        "The overall test root mean square error (RMSE) is 0.054 for input convex recurrent neural networks and 0.051 for conventional RNN, both of which are much smaller than the error made by RC model (0.240)",
        "As shown in Fig. 4(b), with the same constraints on building temperature interval of [19◦C, 24◦C], the building energy consumption is reduced by 23.25% after implementing the new temperature set points calculated by input convex recurrent neural networks",
        "Since there is no guarantee for finding optimal control actions by optimizing over conventional RNN’s input, the control solutions given by conventional RNN could only reduce 11.73% of electricity",
        "In Fig. 4(c) we demonstrate the control actions outputted by our method against model predictive control with conventional RNN in two randomly selected building zones, the building basement and top floor central area",
        "It shows that our proposed\n3Energyplus is an open-source whole-building energy modeling software, which is developed by US Department of Energy for standard building energy simulation approach is able to find a group of stable control actions for the building system control",
        "In this work we proposed a novel optimal control framework that uses deep neural networks engineered to be convex from the input to the output",
        "We show that many interesting data-driven control problems can be cast as convex optimization problems using the proposed network architecture"
    ],
    "summary": [
        "Decisions on how to best operate and control complex physical systems such as the power grid, commercial and industrial buildings, transportation networks and robotic systems are of critical societal importance.",
        "In this paper we tackle the modeling accuracy and control tractability tradeoff by building on the input convex neural networks (ICNN) in (<a class=\"ref-link\" id=\"cAmos_et+al_2017_a\" href=\"#rAmos_et+al_2017_a\">Amos et al, 2017</a>) to both represent system dynamics and to find optimal control policies.",
        "Our proposed method) firstly utilizes an input convex network model to learn the system dynamics and computes the best control decisions via solving a convex model predictive control (MPC) problem, which is tractable and has optimality guarantees.",
        "We describe how input convex neural networks (ICNN) can be extremely useful in these systems by considering two related problems.",
        "[Representation power of ICNN] For any Lipschitz convex function over a compact domain, there exists a neural network with nonnegative weights and ReLU activation functions that approximates it within ε.",
        "Supposing Lemma 1 is true, the proof of Theorem 1 boils down to showing that neural network with nonnegative weights and ReLU activation functions can exactly represent a maximum of affine functions.",
        "The proposed method can be used as a flexible building block in decision making problems, where we use ICNN to represent system dynamics for MuJoco simulators, and we use ICRNN in an end-to-end fashion to find the optimal control inputs.",
        "Both examples demonstrate that proposed method: 1) discovers the connection between controllable variables and the system dynamics or cost objectives; 2) is lightweight and sample-efficient; 3) achieves generalizable and more stable control performances compared with previous model-based reinforcement learning and simplified linear control approaches.",
        "We train and represent the locomotion state transition dynamics st+1 =g2 using a 2-layer ICNN with ReLU activations, which could be integrated into the following finite-horizon control problem to find the optimal action sequence ut , ...,ut+T for fixed looking ahead horizon T : t+T",
        "We firstly learn an ICRNN model f (·) of the building dynamics, which is trained to minimize the error between Pt and f, while nw denotes the memory window of recurrent neural networks.",
        "Where the objective (7a) is minimizing the total energy consumption in future T steps (T is the model predictive control horizon), and (7b) is used for modeling building states, in which g(·) are parameterized as ICRNNs. Note that the formulation (7) is flexible with different loss functions.",
        "In this work we proposed a novel optimal control framework that uses deep neural networks engineered to be convex from the input to the output.",
        "Experiments on both benchmark MuJoCo locomotion tasks and building energy management demonstrate our methodology’s potential in a variety of control and optimization problems"
    ],
    "headline": "We show that these input convex networks can be trained to obtain accurate models of complex physical systems",
    "reference_links": [
        {
            "id": "Amos_et+al_2017_a",
            "entry": "Brandon Amos, Lei Xu, and J Zico Kolter. Input convex neural networks. In International Conference on Machine Learning, pp. 146–155, 2017.",
            "scholar_url": "https://scholar.google.co.uk/scholar?q=Amos%2C%20Brandon%20Xu%2C%20Lei%20Kolter%2C%20J.Zico%20Input%20convex%20neural%20networks%202017",
            "oa_query": "https://api.scholarcy.com/oa_version?query=Amos%2C%20Brandon%20Xu%2C%20Lei%20Kolter%2C%20J.Zico%20Input%20convex%20neural%20networks%202017"
        },
        {
            "id": "Arora_et+al_2016_a",
            "entry": "Raman Arora, Amitabh Basu, Poorya Mianjy, and Anirbit Mukherjee. Understanding deep neural networks with rectified linear units. arXiv preprint arXiv:1611.01491, 2016.",
            "arxiv_url": "https://arxiv.org/pdf/1611.01491"
        },
        {
            "id": "Boyd_2004_a",
            "entry": "Stephen Boyd and Lieven Vandenberghe. Convex optimization. Cambridge university press, 2004.",
            "scholar_url": "https://scholar.google.co.uk/scholar?q=Boyd%2C%20Stephen%20Vandenberghe%2C%20Lieven%20Convex%20optimization%202004"
        },
        {
            "id": "Chia-Chin_et+al_2008_a",
            "entry": "Chia-Chin Cheng, S Pouffary, N Svenningsen, and John M Callaway. The kyoto protocol, the clean development mechanism and the building and construction sector: A report for the unep sustainable buildings and construction initiative, 2008.",
            "scholar_url": "https://scholar.google.co.uk/scholar?q=Chia-Chin%20Cheng%2C%20S.Pouffary%20Svenningsen%2C%20N.%20Callaway%2C%20John%20M.%20The%20kyoto%20protocol%2C%20the%20clean%20development%20mechanism%20and%20the%20building%20and%20construction%20sector%3A%20A%20report%20for%20the%20unep%20sustainable%20buildings%20and%20construction%20initiative%202008"
        },
        {
            "id": "Cox_1971_a",
            "entry": "Morris G Cox. An algorithm for approximating convex functions by means by first degree splines. The Computer Journal, 14(3):272–275, 1971.",
            "scholar_url": "https://scholar.google.co.uk/scholar?q=Cox%2C%20Morris%20G.%20An%20algorithm%20for%20approximating%20convex%20functions%20by%20means%20by%20first%20degree%20splines%201971",
            "oa_query": "https://api.scholarcy.com/oa_version?query=Cox%2C%20Morris%20G.%20An%20algorithm%20for%20approximating%20convex%20functions%20by%20means%20by%20first%20degree%20splines%201971"
        },
        {
            "id": "Crawley_et+al_2001_a",
            "entry": "Drury B Crawley, Linda K Lawrie, Frederick C Winkelmann, Walter F Buhl, Y Joe Huang, Curtis O Pedersen, Richard K Strand, Richard J Liesen, Daniel E Fisher, Michael J Witte, et al. Energyplus: creating a new-generation building energy simulation program. Energy and buildings, 33(4): 319–331, 2001.",
            "scholar_url": "https://scholar.google.co.uk/scholar?q=Crawley%2C%20Drury%20B.%20Lawrie%2C%20Linda%20K.%20Winkelmann%2C%20Frederick%20C.%20Buhl%2C%20Walter%20F.%20creating%20a%20new-generation%20building%20energy%20simulation%20program%202001",
            "oa_query": "https://api.scholarcy.com/oa_version?query=Crawley%2C%20Drury%20B.%20Lawrie%2C%20Linda%20K.%20Winkelmann%2C%20Frederick%20C.%20Buhl%2C%20Walter%20F.%20creating%20a%20new-generation%20building%20energy%20simulation%20program%202001"
        },
        {
            "id": "Deisenroth_et+al_2011_a",
            "entry": "Marc Peter Deisenroth, Carl Edward Rasmussen, and Dieter Fox. Learning to control a low-cost manipulator using data-efficient reinforcement learning. 2011.",
            "scholar_url": "https://scholar.google.co.uk/scholar?q=Deisenroth%2C%20Marc%20Peter%20Rasmussen%2C%20Carl%20Edward%20Fox%2C%20Dieter%20Learning%20to%20control%20a%20low-cost%20manipulator%20using%20data-efficient%20reinforcement%20learning%202011"
        },
        {
            "id": "Duan_et+al_2016_a",
            "entry": "Yan Duan, Xi Chen, Rein Houthooft, John Schulman, and Pieter Abbeel. Benchmarking deep reinforcement learning for continuous control. In International Conference on Machine Learning, pp. 1329–1338, 2016.",
            "scholar_url": "https://scholar.google.co.uk/scholar?q=Duan%2C%20Yan%20Chen%2C%20Xi%20Houthooft%2C%20Rein%20Schulman%2C%20John%20Benchmarking%20deep%20reinforcement%20learning%20for%20continuous%20control%202016",
            "oa_query": "https://api.scholarcy.com/oa_version?query=Duan%2C%20Yan%20Chen%2C%20Xi%20Houthooft%2C%20Rein%20Schulman%2C%20John%20Benchmarking%20deep%20reinforcement%20learning%20for%20continuous%20control%202016"
        },
        {
            "id": "Gavrilovic_1975_a",
            "entry": "Momcilo M Gavrilovic. Optimal approximation of convex curves by functions which are piecewise linear. Journal of Mathematical Analysis and Applications, 52(2):260–282, 1975.",
            "scholar_url": "https://scholar.google.co.uk/scholar?q=Gavrilovic%2C%20Momcilo%20M.%20Optimal%20approximation%20of%20convex%20curves%20by%20functions%20which%20are%20piecewise%20linear%201975",
            "oa_query": "https://api.scholarcy.com/oa_version?query=Gavrilovic%2C%20Momcilo%20M.%20Optimal%20approximation%20of%20convex%20curves%20by%20functions%20which%20are%20piecewise%20linear%201975"
        },
        {
            "id": "Hanin_2017_a",
            "entry": "Boris Hanin. Universal function approximation by deep neural nets with bounded width and relu activations. arXiv preprint arXiv:1708.02691, 2017.",
            "arxiv_url": "https://arxiv.org/pdf/1708.02691"
        },
        {
            "id": "He_et+al_2016_a",
            "entry": "Kaiming He, Xiangyu Zhang, Shaoqing Ren, and Jian Sun. Deep residual learning for image recognition. In Proceedings of the IEEE conference on computer vision and pattern recognition, pp. 770–778, 2016.",
            "scholar_url": "https://scholar.google.co.uk/scholar?q=He%2C%20Kaiming%20Zhang%2C%20Xiangyu%20Ren%2C%20Shaoqing%20Sun%2C%20Jian%20Deep%20residual%20learning%20for%20image%20recognition%202016",
            "oa_query": "https://api.scholarcy.com/oa_version?query=He%2C%20Kaiming%20Zhang%2C%20Xiangyu%20Ren%2C%20Shaoqing%20Sun%2C%20Jian%20Deep%20residual%20learning%20for%20image%20recognition%202016"
        },
        {
            "id": "Kawaguchi_2016_a",
            "entry": "Kenji Kawaguchi. Deep learning without poor local minima. In Advances in Neural Information Processing Systems, pp. 586–594, 2016.",
            "scholar_url": "https://scholar.google.co.uk/scholar?q=Kawaguchi%2C%20Kenji%20Deep%20learning%20without%20poor%20local%20minima%202016",
            "oa_query": "https://api.scholarcy.com/oa_version?query=Kawaguchi%2C%20Kenji%20Deep%20learning%20without%20poor%20local%20minima%202016"
        },
        {
            "id": "Samir_2009_a",
            "entry": "Samir Kouro, Patricio Cortés, René Vargas, Ulrich Ammann, and José Rodríguez. Model predictive control—a simple and powerful method to control power converters. IEEE Transactions on industrial electronics, 56(6):1826–1838, 2009.",
            "scholar_url": "https://scholar.google.co.uk/scholar?q=Samir%20Kouro%20Patricio%20Cort%C3%A9s%20Ren%C3%A9%20Vargas%20Ulrich%20Ammann%20and%20Jos%C3%A9%20Rodr%C3%ADguez%20Model%20predictive%20controla%20simple%20and%20powerful%20method%20to%20control%20power%20converters%20IEEE%20Transactions%20on%20industrial%20electronics%2056618261838%202009",
            "oa_query": "https://api.scholarcy.com/oa_version?query=Samir%20Kouro%20Patricio%20Cort%C3%A9s%20Ren%C3%A9%20Vargas%20Ulrich%20Ammann%20and%20Jos%C3%A9%20Rodr%C3%ADguez%20Model%20predictive%20controla%20simple%20and%20powerful%20method%20to%20control%20power%20converters%20IEEE%20Transactions%20on%20industrial%20electronics%2056618261838%202009"
        },
        {
            "id": "Levine_2014_a",
            "entry": "Sergey Levine and Vladlen Koltun. Learning complex neural network policies with trajectory optimization. In International Conference on Machine Learning, pp. 829–837, 2014.",
            "scholar_url": "https://scholar.google.co.uk/scholar?q=Levine%2C%20Sergey%20Koltun%2C%20Vladlen%20Learning%20complex%20neural%20network%20policies%20with%20trajectory%20optimization%202014",
            "oa_query": "https://api.scholarcy.com/oa_version?query=Levine%2C%20Sergey%20Koltun%2C%20Vladlen%20Learning%20complex%20neural%20network%20policies%20with%20trajectory%20optimization%202014"
        },
        {
            "id": "Levine_et+al_2016_a",
            "entry": "Sergey Levine, Chelsea Finn, Trevor Darrell, and Pieter Abbeel. End-to-end training of deep visuomotor policies. The Journal of Machine Learning Research, 17(1):1334–1373, 2016.",
            "scholar_url": "https://scholar.google.co.uk/scholar?q=Levine%2C%20Sergey%20Finn%2C%20Chelsea%20Darrell%2C%20Trevor%20Abbeel%2C%20Pieter%20End-to-end%20training%20of%20deep%20visuomotor%20policies%202016",
            "oa_query": "https://api.scholarcy.com/oa_version?query=Levine%2C%20Sergey%20Finn%2C%20Chelsea%20Darrell%2C%20Trevor%20Abbeel%2C%20Pieter%20End-to-end%20training%20of%20deep%20visuomotor%20policies%202016"
        },
        {
            "id": "Ma_et+al_2012_a",
            "entry": "Yudong Ma, Anthony Kelman, Allan Daly, and Francesco Borrelli. Predictive control for energy efficient buildings with thermal storage: Modeling, stimulation, and experiments. IEEE Control Systems, 32(1):44–64, 2012.",
            "scholar_url": "https://scholar.google.co.uk/scholar?q=Ma%2C%20Yudong%20Kelman%2C%20Anthony%20Daly%2C%20Allan%20Borrelli%2C%20Francesco%20Predictive%20control%20for%20energy%20efficient%20buildings%20with%20thermal%20storage%3A%20Modeling%2C%20stimulation%2C%20and%20experiments%202012",
            "oa_query": "https://api.scholarcy.com/oa_version?query=Ma%2C%20Yudong%20Kelman%2C%20Anthony%20Daly%2C%20Allan%20Borrelli%2C%20Francesco%20Predictive%20control%20for%20energy%20efficient%20buildings%20with%20thermal%20storage%3A%20Modeling%2C%20stimulation%2C%20and%20experiments%202012"
        },
        {
            "id": "Magnani_2009_a",
            "entry": "Alessandro Magnani and Stephen P Boyd. Convex piecewise-linear fitting. Optimization and Engineering, 10(1):1–17, 2009.",
            "scholar_url": "https://scholar.google.co.uk/scholar?q=Magnani%2C%20Alessandro%20Boyd%2C%20Stephen%20P.%20Convex%20piecewise-linear%20fitting%202009",
            "oa_query": "https://api.scholarcy.com/oa_version?query=Magnani%2C%20Alessandro%20Boyd%2C%20Stephen%20P.%20Convex%20piecewise-linear%20fitting%202009"
        },
        {
            "id": "Meger_et+al_2015_a",
            "entry": "David Meger, Juan Camilo Gamboa Higuera, Anqi Xu, Philippe Giguere, and Gregory Dudek. Learning legged swimming gaits from experience. In Robotics and Automation (ICRA), 2015 IEEE International Conference on, pp. 2332–2338. IEEE, 2015.",
            "scholar_url": "https://scholar.google.co.uk/scholar?q=Meger%2C%20David%20Higuera%2C%20Juan%20Camilo%20Gamboa%20Xu%2C%20Anqi%20Giguere%2C%20Philippe%20Learning%20legged%20swimming%20gaits%20from%20experience%202015",
            "oa_query": "https://api.scholarcy.com/oa_version?query=Meger%2C%20David%20Higuera%2C%20Juan%20Camilo%20Gamboa%20Xu%2C%20Anqi%20Giguere%2C%20Philippe%20Learning%20legged%20swimming%20gaits%20from%20experience%202015"
        },
        {
            "id": "Mnih_et+al_2013_a",
            "entry": "Volodymyr Mnih, Koray Kavukcuoglu, David Silver, Alex Graves, Ioannis Antonoglou, Daan Wierstra, and Martin Riedmiller. Playing atari with deep reinforcement learning. arXiv preprint arXiv:1312.5602, 2013.",
            "arxiv_url": "https://arxiv.org/pdf/1312.5602"
        },
        {
            "id": "Mnih_et+al_2015_a",
            "entry": "Volodymyr Mnih, Koray Kavukcuoglu, David Silver, Andrei A Rusu, Joel Veness, Marc G Bellemare, Alex Graves, Martin Riedmiller, Andreas K Fidjeland, Georg Ostrovski, et al. Human-level control through deep reinforcement learning. Nature, 518(7540):529, 2015.",
            "scholar_url": "https://scholar.google.co.uk/scholar?q=Mnih%2C%20Volodymyr%20Kavukcuoglu%2C%20Koray%20Silver%2C%20David%20Rusu%2C%20Andrei%20A.%20Human-level%20control%20through%20deep%20reinforcement%20learning%202015",
            "oa_query": "https://api.scholarcy.com/oa_version?query=Mnih%2C%20Volodymyr%20Kavukcuoglu%2C%20Koray%20Silver%2C%20David%20Rusu%2C%20Andrei%20A.%20Human-level%20control%20through%20deep%20reinforcement%20learning%202015"
        },
        {
            "id": "Nagabandi_et+al_2018_a",
            "entry": "Anusha Nagabandi, Gregory Kahn, Ronald S Fearing, and Sergey Levine. Neural network dynamics for model-based deep reinforcement learning with model-free fine-tuning. In 2018 IEEE International Conference on Robotics and Automation (ICRA), pp. 7559–7566. IEEE, 2018.",
            "scholar_url": "https://scholar.google.co.uk/scholar?q=Nagabandi%2C%20Anusha%20Kahn%2C%20Gregory%20Fearing%2C%20Ronald%20S.%20Levine%2C%20Sergey%20Neural%20network%20dynamics%20for%20model-based%20deep%20reinforcement%20learning%20with%20model-free%20fine-tuning%202018",
            "oa_query": "https://api.scholarcy.com/oa_version?query=Nagabandi%2C%20Anusha%20Kahn%2C%20Gregory%20Fearing%2C%20Ronald%20S.%20Levine%2C%20Sergey%20Neural%20network%20dynamics%20for%20model-based%20deep%20reinforcement%20learning%20with%20model-free%20fine-tuning%202018"
        },
        {
            "id": "O_et+al_2010_a",
            "entry": "Daniel O’Neill, Marco Levorato, Andrea Goldsmith, and Urbashi Mitra. Residential demand response using reinforcement learning. In Smart Grid Communications (SmartGridComm), 2010 First IEEE International Conference on, pp. 409–414. IEEE, 2010.",
            "scholar_url": "https://scholar.google.co.uk/scholar?q=O%E2%80%99Neill%2C%20Daniel%20Levorato%2C%20Marco%20Goldsmith%2C%20Andrea%20Mitra%2C%20Urbashi%20Residential%20demand%20response%20using%20reinforcement%20learning%202010",
            "oa_query": "https://api.scholarcy.com/oa_version?query=O%E2%80%99Neill%2C%20Daniel%20Levorato%2C%20Marco%20Goldsmith%2C%20Andrea%20Mitra%2C%20Urbashi%20Residential%20demand%20response%20using%20reinforcement%20learning%202010"
        },
        {
            "id": "Ross_et+al_2011_a",
            "entry": "Stéphane Ross, Geoffrey Gordon, and Drew Bagnell. A reduction of imitation learning and structured prediction to no-regret online learning. In Proceedings of the fourteenth international conference on artificial intelligence and statistics, pp. 627–635, 2011.",
            "scholar_url": "https://scholar.google.co.uk/scholar?q=Ross%2C%20St%C3%A9phane%20Gordon%2C%20Geoffrey%20Bagnell%2C%20Drew%20A%20reduction%20of%20imitation%20learning%20and%20structured%20prediction%20to%20no-regret%20online%20learning%202011",
            "oa_query": "https://api.scholarcy.com/oa_version?query=Ross%2C%20St%C3%A9phane%20Gordon%2C%20Geoffrey%20Bagnell%2C%20Drew%20A%20reduction%20of%20imitation%20learning%20and%20structured%20prediction%20to%20no-regret%20online%20learning%202011"
        },
        {
            "id": "Royden_2010_a",
            "entry": "HL Royden and PM Fitzpatrick. Real analysis. 4th, 2010.",
            "scholar_url": "https://scholar.google.co.uk/scholar?q=Royden%2C%20H.L.%20Fitzpatrick%2C%20P.M.%20Real%20analysis%202010"
        },
        {
            "id": "Schulman_et+al_2015_a",
            "entry": "John Schulman, Sergey Levine, Pieter Abbeel, Michael Jordan, and Philipp Moritz. Trust region policy optimization. In International Conference on Machine Learning, pp. 1889–1897, 2015.",
            "scholar_url": "https://scholar.google.co.uk/scholar?q=Schulman%2C%20John%20Levine%2C%20Sergey%20Abbeel%2C%20Pieter%20Jordan%2C%20Michael%20Trust%20region%20policy%20optimization%202015",
            "oa_query": "https://api.scholarcy.com/oa_version?query=Schulman%2C%20John%20Levine%2C%20Sergey%20Abbeel%2C%20Pieter%20Jordan%2C%20Michael%20Trust%20region%20policy%20optimization%202015"
        },
        {
            "id": "Shaikh_et+al_2014_a",
            "entry": "Pervez Hameed Shaikh, Nursyarizal Bin Mohd Nor, Perumal Nallagownden, Irraivan Elamvazuthi, and Taib Ibrahim. A review on optimized control systems for building energy and comfort management of smart sustainable buildings. Renewable and Sustainable Energy Reviews, 34: 409–429, 2014.",
            "scholar_url": "https://scholar.google.co.uk/scholar?q=Shaikh%2C%20Pervez%20Hameed%20Nor%2C%20Nursyarizal%20Bin%20Mohd%20Nallagownden%2C%20Perumal%20Elamvazuthi%2C%20Irraivan%20A%20review%20on%20optimized%20control%20systems%20for%20building%20energy%20and%20comfort%20management%20of%20smart%20sustainable%20buildings%202014",
            "oa_query": "https://api.scholarcy.com/oa_version?query=Shaikh%2C%20Pervez%20Hameed%20Nor%2C%20Nursyarizal%20Bin%20Mohd%20Nallagownden%2C%20Perumal%20Elamvazuthi%2C%20Irraivan%20A%20review%20on%20optimized%20control%20systems%20for%20building%20energy%20and%20comfort%20management%20of%20smart%20sustainable%20buildings%202014"
        },
        {
            "id": "Shi_et+al_2018_a",
            "entry": "Y. Shi, B. Xu, Y. Tan, D. Kirschen, and B. Zhang. Optimal battery control under cycle aging mechanisms in pay for performance settings. IEEE Transactions on Automatic Control, pp. 1–1, 2018. ISSN 0018-9286. doi: 10.1109/TAC.2018.2867507.",
            "crossref": "https://dx.doi.org/10.1109/TAC.2018.2867507",
            "oa_query": "https://api.scholarcy.com/oa_version?query=https%3A//dx.doi.org/10.1109/TAC.2018.2867507"
        },
        {
            "id": "Skogestad_2007_a",
            "entry": "Sigurd Skogestad and Ian Postlethwaite. Multivariable feedback control: analysis and design, volume 2. Wiley New York, 2007.",
            "scholar_url": "https://scholar.google.co.uk/scholar?q=Skogestad%2C%20Sigurd%20Postlethwaite%2C%20Ian%20Multivariable%20feedback%20control%3A%20analysis%20and%20design%2C%20volume%202%202007"
        },
        {
            "id": "Suryadevara_et+al_2015_a",
            "entry": "Nagender Kumar Suryadevara, Subhas Chandra Mukhopadhyay, Sean Dieter Tebje Kelly, and Satinder Pal Singh Gill. Wsn-based smart sensors and actuator for power management in intelligent buildings. IEEE/ASME transactions on mechatronics, 20(2):564–571, 2015.",
            "scholar_url": "https://scholar.google.co.uk/scholar?q=Suryadevara%2C%20Nagender%20Kumar%20Mukhopadhyay%2C%20Subhas%20Chandra%20Kelly%2C%20Sean%20Dieter%20Tebje%20Gill%2C%20Satinder%20Pal%20Singh%20Wsn-based%20smart%20sensors%20and%20actuator%20for%20power%20management%20in%20intelligent%20buildings%202015",
            "oa_query": "https://api.scholarcy.com/oa_version?query=Suryadevara%2C%20Nagender%20Kumar%20Mukhopadhyay%2C%20Subhas%20Chandra%20Kelly%2C%20Sean%20Dieter%20Tebje%20Gill%2C%20Satinder%20Pal%20Singh%20Wsn-based%20smart%20sensors%20and%20actuator%20for%20power%20management%20in%20intelligent%20buildings%202015"
        },
        {
            "id": "Todorov_et+al_2012_a",
            "entry": "Emanuel Todorov, Tom Erez, and Yuval Tassa. Mujoco: A physics engine for model-based control. In Intelligent Robots and Systems (IROS), 2012 IEEE/RSJ International Conference on, pp. 5026– 5033. IEEE, 2012.",
            "scholar_url": "https://scholar.google.co.uk/scholar?q=Todorov%2C%20Emanuel%20Erez%2C%20Tom%20Tassa%2C%20Yuval%20Mujoco%3A%20A%20physics%20engine%20for%20model-based%20control%202012",
            "oa_query": "https://api.scholarcy.com/oa_version?query=Todorov%2C%20Emanuel%20Erez%2C%20Tom%20Tassa%2C%20Yuval%20Mujoco%3A%20A%20physics%20engine%20for%20model-based%20control%202012"
        },
        {
            "id": "Published_2019_a",
            "entry": "Published as a conference paper at ICLR 2019 Ashish Vaswani, Noam Shazeer, Niki Parmar, Jakob Uszkoreit, Llion Jones, Aidan N Gomez, Łukasz",
            "scholar_url": "https://scholar.google.co.uk/scholar?q=Published%20as%20a%20conference%20paper%20at%20ICLR%202019%20Ashish%20Vaswani%20Noam%20Shazeer%20Niki%20Parmar%20Jakob%20Uszkoreit%20Llion%20Jones%20Aidan%20N%20Gomez%20%C5%81ukasz"
        },
        {
            "id": "Kaiser_2017_a",
            "entry": "Kaiser, and Illia Polosukhin. Attention is all you need. In Advances in Neural Information Processing Systems, pp. 6000–6010, 2017. Shuning Wang. General constructive representations for continuous piecewise-linear functions. IEEE Transactions on Circuits and Systems I: Regular Papers, 51(9):1889–1896, 2004.",
            "scholar_url": "https://scholar.google.co.uk/scholar?q=Kaiser%20Polosukhin%2C%20Illia%20Attention%20is%20all%20you%20need%202017",
            "oa_query": "https://api.scholarcy.com/oa_version?query=Kaiser%20Polosukhin%2C%20Illia%20Attention%20is%20all%20you%20need%202017"
        },
        {
            "id": "Wei_et+al_2017_a",
            "entry": "T. Wei, Y. Wang, and Q. Zhu. Deep reinforcement learning for building hvac control. In The Design and Automation Conference, 2017. W. Wolf. Cyber-physical systems. Computer, 42:88–89, 2009. Zhaohui Zhang, Ruilong Deng, Tao Yuan, and S Joe Qin. Distributed optimization of multi-building energy systems with spatially and temporally coupled constraints. In American Control Conference (ACC), 2017, pp. 2913–2918. IEEE, 2017.",
            "scholar_url": "https://scholar.google.co.uk/scholar?q=Wei%2C%20T.%20Wang%2C%20Y.%20Zhu%2C%20Q.%20Deep%20reinforcement%20learning%20for%20building%20hvac%20control%202017",
            "oa_query": "https://api.scholarcy.com/oa_version?query=Wei%2C%20T.%20Wang%2C%20Y.%20Zhu%2C%20Q.%20Deep%20reinforcement%20learning%20for%20building%20hvac%20control%202017"
        }
    ]
}
