{
    "filename": "pdf.pdf",
    "metadata": {
        "title": "An approach to analyzing biped locomotion dynamics and designing robot locomotion controls",
        "author": "C. Golliday, H. Hemami",
        "date": 2004,
        "identifiers": {
            "url": "https://openreview.net/pdf?id=BklHpjCqKm",
            "doi": "10.1109/tac.1977.1101650"
        },
        "journal": "IEEE Transactions on Automatic Control",
        "volume": "22",
        "abstract": "Deep learning has achieved astonishing results on many tasks with large amounts of data and generalization within the proximity of training data. For many important real-world applications, these requirements are unfeasible and additional prior knowledge on the task domain is required to overcome the resulting problems. In particular, learning physics models for model-based control requires robust extrapolation from fewer samples – often collected online in real-time – and model errors may lead to drastic damages of the system. Directly incorporating physical insight has enabled us to obtain a novel deep model learning approach that extrapolates well while requiring fewer samples. As a first example, we propose Deep Lagrangian Networks (DeLaN) as a deep network structure upon which Lagrangian Mechanics have been imposed. DeLaN can learn the equations of motion of a mechanical system (i.e., system dynamics) with a deep network efficiently while ensuring physical plausibility. The resulting DeLaN network performs very well at robot tracking control. The proposed method did not only outperform previous model learning approaches at learning speed but exhibits substantially improved and more robust extrapolation to novel trajectories and learns online in real-time.",
        "pages": "963-972"
    },
    "keywords": [
        {
            "term": "feed-forward neural network",
            "url": "https://en.wikipedia.org/wiki/feed-forward_neural_network"
        },
        {
            "term": "dynamics",
            "url": "https://en.wikipedia.org/wiki/dynamics"
        },
        {
            "term": "network structure",
            "url": "https://en.wikipedia.org/wiki/network_structure"
        },
        {
            "term": "physics",
            "url": "https://en.wikipedia.org/wiki/physics"
        },
        {
            "term": "deep network",
            "url": "https://en.wikipedia.org/wiki/deep_network"
        },
        {
            "term": "Mechanics",
            "url": "https://en.wikipedia.org/wiki/Mechanics"
        },
        {
            "term": "topology",
            "url": "https://en.wikipedia.org/wiki/topology"
        },
        {
            "term": "real time",
            "url": "https://en.wikipedia.org/wiki/real_time"
        },
        {
            "term": "mean squared error",
            "url": "https://en.wikipedia.org/wiki/mean_squared_error"
        },
        {
            "term": "ordinary differential equation",
            "url": "https://en.wikipedia.org/wiki/ordinary_differential_equation"
        },
        {
            "term": "lagrangian mechanics",
            "url": "https://en.wikipedia.org/wiki/lagrangian_mechanics"
        },
        {
            "term": "partial differential equations",
            "url": "https://en.wikipedia.org/wiki/partial_differential_equations"
        }
    ],
    "abbreviations": {
        "DeLaN": "Deep Lagrangian Networks",
        "ODE": "ordinary differential equation",
        "PDE": "partial differential equations",
        "MSE": "mean squared error",
        "RNE": "Recursive Newton Euler algorithm",
        "SI": "system identification approach",
        "FF-NN": "feed-forward neural network"
    },
    "highlights": [
        "We propose Deep Lagrangian Networks (DeLaN) as a deep network structure upon which Lagrangian Mechanics have been imposed",
        "Deep Lagrangian Networks can learn the equations of motion of a mechanical system with a deep network efficiently while ensuring physical plausibility",
        "We derive a network topology called Deep Lagrangian Networks (DeLaN) encoding the Euler-Lagrange equation originating from Lagrangian Mechanics",
        "We demonstrate Deep Lagrangian Networks’s control performance where Deep Lagrangian Networks learns the dynamics model online starting from random initialization",
        "The quantitative evaluation within a real-time control loop assessing the tracking error showed that Deep Lagrangian Networks can learn the system dynamics online, obtains lower sample complexity and better generalization compared to a feed-forward neural network"
    ],
    "key_statements": [
        "We propose Deep Lagrangian Networks (DeLaN) as a deep network structure upon which Lagrangian Mechanics have been imposed",
        "Deep Lagrangian Networks can learn the equations of motion of a mechanical system with a deep network efficiently while ensuring physical plausibility",
        "We derive a network topology called Deep Lagrangian Networks (DeLaN) encoding the Euler-Lagrange equation originating from Lagrangian Mechanics",
        "We demonstrate Deep Lagrangian Networks’s control performance where Deep Lagrangian Networks learns the dynamics model online starting from random initialization",
        "To demonstrate the applicability and extrapolation of Deep Lagrangian Networks, the proposed network topology is applied to model-based control for a simulated 2-dof robot (Figure 3b) and the physical 7-dof robot",
        "The performance of Deep Lagrangian Networks is compared to an analytic inverse dynamics model, a standard feedforward neural network (FF-NN) and a PD-Controller",
        "Deep Lagrangian Networks is capable of learning the underlying physical model using the proposed network topology trained with standard end-to-end optimization",
        "For the physical experiments we focus on the cosine trajectories as these trajectories produce dynamic movements while character trajectories are mainly dominated by the gravitational forces",
        "On the training trajectories executed on the physical system the feed-forward neural network performs better compared to Deep Lagrangian Networks and the analytic model",
        "We showed that Deep Lagrangian Networks is able to learn the underlying physics from a super-imposed signal, as Deep Lagrangian Networks can recover the contribution of the inertial-, gravitational and centripetal forces from sensor data",
        "The quantitative evaluation within a real-time control loop assessing the tracking error showed that Deep Lagrangian Networks can learn the system dynamics online, obtains lower sample complexity and better generalization compared to a feed-forward neural network"
    ],
    "summary": [
        "DeLaN can learn the equations of motion of a mechanical system with a deep network efficiently while ensuring physical plausibility.",
        "In comparison to analytic- and other learned models, DeLaN yields a better control performance while at the same time extrapolates to new desired trajectories.",
        "E.g., authors used Linear Regression (Schaal et al, 2002; Haruno et al, 2001), Gaussian Mixture Regression (Calinon et al, 2010; Khansari-Zadeh & Billard, 2011), Gaussian Process Regression (Kocijan et al, 2004; Nguyen-Tuong et al, 2009; Nguyen-Tuong & Peters, 2010), Support Vector Regression (Choi et al, 2007; Ferreira et al, 2007), feedforward- (Jansen, 1994; Lenz et al, 2015; Ledezma & Haddadin, 2017; Sanchez-Gonzalez et al, 2018) or recurrent neural networks (Rueckert et al, 2017) to fit the model to the observed measurements.",
        "While the work of Atkeson et al (1986), commonly referenced as the standard system identification technique for robot manipulators (Siciliano & Khatib, 2016), uses the Newton-Euler formalism to derive physics features using the kinematic structure and the joint measurements such that the learning of the dynamics model simplifies to linear regression.",
        "To demonstrate the applicability and extrapolation of DeLaN, the proposed network topology is applied to model-based control for a simulated 2-dof robot (Figure 3b) and the physical 7-dof robot",
        "The performance of DeLaN is evaluated using the tracking error on train and test trajectories and compared to a learned and analytic model.",
        "The performance of DeLaN is compared to an analytic inverse dynamics model, a standard feedforward neural network (FF-NN) and a PD-Controller.",
        "DeLaN is capable of learning the underlying physical model using the proposed network topology trained with standard end-to-end optimization.",
        "On the training trajectories executed on the physical system the FF-NN performs better compared to DeLaN and the analytic model.",
        "This low tracking error on all test trajectories highlights the improved extrapolation of DeLaN compared to other model learning approaches.",
        "The quantitative evaluation within a real-time control loop assessing the tracking error showed that DeLaN can learn the system dynamics online, obtains lower sample complexity and better generalization compared to a feed-forward neural network.",
        "DeLaN can extrapolate to new trajectories as well as to increased velocities, where the performance of the feedforward network deteriorates due to the overfitting to the training data.",
        "DeLaN is compared to the system identification approach (SI) described by Atkeson et al (1986), a feed-forward neural network (FF-NN) and the Recursive Newton Euler algorithm (RNE) using an analytic model."
    ],
    "headline": "We propose Deep Lagrangian Networks as a deep network structure upon which Lagrangian Mechanics have been imposed",
    "reference_links": []
}
